# Параметры модели

z0, zm = 0, 70

P_t0 = 10  
Z0_t0 = 10
# N0_t0 = 50
# Nm_t0 = 150
N0_t0 = 100
Nm_t0 = 800
N_init = 400
N_bound = 200
T0_t0 = 3.685
Tm_t0 = 0.5
Y0_t0 = 200
Ym_t0 = 400

K = 3
k_temp = 1.3 * (10 ** (-7)) # м2/с

M_max = 0.3
mu_maxI = 0.4
N0 = 62
I0 = 10
I_thr = 130
alpha0 = 0.018
alpha_1 = 0.04
alpha_2 = 0.07
A11 = 0.2
A21 = 0.5
A31 = 0.01

A16 = 0.2
A26 = 0.5
A36 = 0.01
A46 = 4.49
B1 = 1/3

alpha1 = alpha_1 * A11 * A21 * A31
alpha2 = alpha_2 * A16 * A26 * A36 * A46 * B1
# alpha1 = 0
# alpha2 = 0
b = 0.005
Z_thr = 50

Imin = 53 # Вт/м2
A_L = 150 # Вт/м2
I_thr = 130
t_maxI = 137 # середина июля
t_maxT = 137 # середина июля
t_max = 152 # июль-август

T0 = 3 # гр Ц
A_T = 1.5 # гр Ц
T1 = -8 # гр Ц
T2 = -2 # гр Ц

c0 = 0.0042176 # удельная теплоёмкость воды при 0 [дж/(мг*град Ц)]
rho0 = 10 ** (-6) # плотность воды, мг/м^3
rho_a = 1290 # плотность воздуха, мг/м^3
c_p = 1.005 # средняя удельная теплоёмкость воздуха при 0 [дж/(мг*град Ц)]
C_h = 0.4 * (10 ** (-4)) # коэффициент обмена теплом
W = 5 # скорость ветра, м/с
lambda_w = 0.56 # теплопроводность воды [Вт/(м*К)]

Ep_min = 0.05 # сут^(-1)
Ez_min = 0.0044 # сут^(-1)
Ey_min = 0.035 # сут^(-1)
A_cp = 0.14 # (гр Ц)^-1
A_cz = 0.14 # (гр Ц)^-1
A_cy = 0.069 # (гр Ц)^-1
T_min = 1 # гр Ц

Up = 5 # мг/м3, предельная конц. фитопланктона, начиная с которой его ест зоопланктон

R_pzmax = 0.1
R_pz = 50
R_ypmax = 0.048
R_yp = 500
kappa_yp = 0.67
rho = 0.0276
kappa_pz = 0.1
kappa_yz = 0

D_np = 0.05
D_ny = 0.015

Q1 = 1.74 * (10 ** (10))
V = 3.5 * (10 ** (12))
X_ns = 50
Q2 = 1.31 * (10 ** (10))
X_nb = 400
W_F = 0.08 * (10 ** (10))
X_nd = 700

I_0 = 25
p_N = 10
z_N = 10
n_N = 400
y_N = 200 